Transmitter/src/Catalogs/ОбработчикиВнешнихЗапросов/ОбработчикиВнешнихЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбработчикиВнешнихЗапросов</name>
  <attributes>
    <name>АдресПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСобытий</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПриложения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Transmitter/src/Catalogs/ОбработчикиВнешнихЗапросов/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// НайтиПоАдресуПроекта возвращает результат поиска обработчиков внешних запросов по адресу проекта.
// Поиск осуществляется среди элементов не помеченных на удаление.
// 
// Параметры:
// 	Адрес - Строка - адрес проекта (URL);
// 	
// Возвращаемое значение:
// 	Массив из Структура - результат поиска:
// 	* Обработчик - СправочникСсылка.ОбработчикиВнешнихЗапросов - обработчик внешних запросов;
// 	* Токен - Строка - токен внешнего хранилища;
//
Функция НайтиПоАдресуПроекта( Знач Адрес ) Экспорт
	
	Если ( ТипЗнч(Адрес) <> Тип("Строка") ) Then
		
		Возврат Новый Массив();
		
	КонецЕсли;
	
	Запрос = Новый Запрос( ТекстЗапросаПолученияЭлементаСправочникаПоАдресуПроекта() );

	Запрос.УстановитьПараметр( "Адрес", Адрес );
	
	Возврат ОбщегоНазначенияВызовСервера.ТаблицаЗначенийВМассив( Запрос.Выполнить().Выгрузить() );
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияЭлементаСправочникаПоАдресуПроекта()
	
	Возврат "ВЫБРАТЬ
	|	ОбработчикиВнешнихЗапросов.Ссылка КАК Обработчик,
	|	ОбработчикиВнешнихЗапросов.Токен КАК Токен
	|ИЗ
	|	Справочник.ОбработчикиВнешнихЗапросов КАК ОбработчикиВнешнихЗапросов
	|ГДЕ
	|	НЕ ОбработчикиВнешнихЗапросов.ПометкаУдаления
	|	И ОбработчикиВнешнихЗапросов.АдресПроекта = &Адрес";
	
КонецФункции

#КонецОбласти

#КонецЕсли
